<template>
  <div>
    <dataTable :columns="columns" :tableData="tableData"></dataTable>
  </div>
</template>
<style lang="scss" scoped></style>
<script>
import dataTable from './components/data-table'
export default {
  components: {
    dataTable
  },
  props: {},
  data() {
    return {
      columns: [
        {
          label: '日期',
          prop: '日期'
        },
        {
          label: '急诊总人数',
          prop: '急诊总人数'
        },
        {
          label: '溶栓再通患者人数',
          prop: '溶栓再通患者人数'
        },
        {
          label: '占比',
          prop: '占比'
        }
      ],
      tableData: [
        {
          日期: '2020-11-20',
          急诊总人数: '32',
          溶栓再通患者人数: '1',
          占比: '3.13%'
        },
        {
          日期: '2020/11/19',
          急诊总人数: '112',
          溶栓再通患者人数: '2',
          占比: '1.79%'
        },
        {
          日期: '2020/11/18',
          急诊总人数: '32',
          溶栓再通患者人数: '2',
          占比: '6.25%'
        },
        {
          日期: '2020/11/17',
          急诊总人数: '53',
          溶栓再通患者人数: '2',
          占比: '3.77%'
        },
        {
          日期: '2020/11/16',
          急诊总人数: '26',
          溶栓再通患者人数: '0',
          占比: '0.00%'
        },
        {
          日期: '2020/11/15',
          急诊总人数: '46',
          溶栓再通患者人数: '1',
          占比: '2.17%'
        },
        {
          日期: '2020/11/14',
          急诊总人数: '33',
          溶栓再通患者人数: '1',
          占比: '3.03%'
        },
        {
          日期: '2020/11/13',
          急诊总人数: '75',
          溶栓再通患者人数: '0',
          占比: '0.00%'
        },
        {
          日期: '2020/11/12',
          急诊总人数: '32',
          溶栓再通患者人数: '2',
          占比: '6.25%'
        },
        {
          日期: '2020/11/11',
          急诊总人数: '26',
          溶栓再通患者人数: '2',
          占比: '7.69%'
        },
        {
          日期: '2020/11/10',
          急诊总人数: '46',
          溶栓再通患者人数: '1',
          占比: '2.17%'
        },
        {
          日期: '2020/11/9',
          急诊总人数: '33',
          溶栓再通患者人数: '1',
          占比: '3.03%'
        },
        {
          日期: '2020/11/8',
          急诊总人数: '75',
          溶栓再通患者人数: '0',
          占比: '0.00%'
        },
        {
          日期: '2020/11/7',
          急诊总人数: '33',
          溶栓再通患者人数: '1',
          占比: '3.03%'
        }
      ]
    }
  },
  methods: {}
}
</script>
