<template>
  <div>
    <dataTable :columns="columns" :tableData="tableData"></dataTable>
  </div>
</template>
<style lang="scss" scoped></style>
<script>
import dataTable from './components/data-table'
export default {
  components: {
    dataTable
  },
  props: {},
  data() {
    return {
      columns: [
        {
          label: '日期',
          prop: '日期'
        },
        {
          label: '急诊总人数',
          prop: '急诊总人数'
        },
        {
          label: '步行',
          prop: '步行'
        },
        {
          label: '步行占比',
          prop: '步行占比'
        },
        {
          label: '扶行',
          prop: '扶行'
        },
        {
          label: '扶行占比',
          prop: '扶行占比'
        },
        {
          label: '轮椅',
          prop: '轮椅'
        },
        {
          label: '轮椅占比',
          prop: '轮椅占比'
        },
        {
          label: '平车',
          prop: '平车'
        },
        {
          label: '平车占比',
          prop: '平车占比'
        },
        {
          label: '担架',
          prop: '担架'
        },
        {
          label: '担架占比',
          prop: '担架占比'
        },
        {
          label: '背入',
          prop: '背入'
        },
        {
          label: '背入占比',
          prop: '背入占比'
        },
        {
          label: '怀抱',
          prop: '怀抱'
        },
        {
          label: '怀抱占比',
          prop: '怀抱占比'
        },
        {
          label: '车',
          prop: '车'
        },
        {
          label: '车占比',
          prop: '车占比'
        },
        {
          label: '其他',
          prop: '其他'
        },
        {
          label: '其他占比',
          prop: '其他占比'
        }
      ],
      tableData: [
        {
          日期: '2020-11-20',
          急诊总人数: '32',
          步行: '2',
          步行占比: '6.25%',
          扶行: '4',
          扶行占比: '12.50%',
          轮椅: '0',
          轮椅占比: '0.00%',
          平车: '2',
          平车占比: '6.25%',
          担架: '4',
          担架占比: '12.50%',
          背入: '4',
          背入占比: '12.50%',
          怀抱: '6',
          怀抱占比: '18.75%',
          车: '6',
          车占比: '18.75%',
          其他: '4',
          其他占比: '12.50%'
        },
        {
          日期: '2020/11/19',
          急诊总人数: '112',
          步行: '5',
          步行占比: '4.46%',
          扶行: '5',
          扶行占比: '4.46%',
          轮椅: '3',
          轮椅占比: '2.68%',
          平车: '16',
          平车占比: '14.29%',
          担架: '21',
          担架占比: '18.75%',
          背入: '22',
          背入占比: '19.64%',
          怀抱: '4',
          怀抱占比: '3.57%',
          车: '26',
          车占比: '23.21%',
          其他: '10',
          其他占比: '8.93%'
        },
        {
          日期: '2020/11/18',
          急诊总人数: '32',
          步行: '7',
          步行占比: '21.88%',
          扶行: '4',
          扶行占比: '12.50%',
          轮椅: '4',
          轮椅占比: '12.50%',
          平车: '0',
          平车占比: '0.00%',
          担架: '6',
          担架占比: '18.75%',
          背入: '1',
          背入占比: '3.13%',
          怀抱: '6',
          怀抱占比: '18.75%',
          车: '4',
          车占比: '12.50%',
          其他: '0',
          其他占比: '0.00%'
        },
        {
          日期: '2020/11/17',
          急诊总人数: '53',
          步行: '8',
          步行占比: '15.09%',
          扶行: '6',
          扶行占比: '11.32%',
          轮椅: '6',
          轮椅占比: '11.32%',
          平车: '0',
          平车占比: '0.00%',
          担架: '8',
          担架占比: '15.09%',
          背入: '6',
          背入占比: '11.32%',
          怀抱: '9',
          怀抱占比: '16.98%',
          车: '5',
          车占比: '9.43%',
          其他: '5',
          其他占比: '9.43%'
        },
        {
          日期: '2020/11/16',
          急诊总人数: '26',
          步行: '6',
          步行占比: '23.08%',
          扶行: '0',
          扶行占比: '0.00%',
          轮椅: '3',
          轮椅占比: '11.54%',
          平车: '3',
          平车占比: '11.54%',
          担架: '5',
          担架占比: '19.23%',
          背入: '1',
          背入占比: '3.85%',
          怀抱: '3',
          怀抱占比: '11.54%',
          车: '2',
          车占比: '7.69%',
          其他: '3',
          其他占比: '11.54%'
        },
        {
          日期: '2020/11/15',
          急诊总人数: '46',
          步行: '5',
          步行占比: '10.87%',
          扶行: '0',
          扶行占比: '0.00%',
          轮椅: '2',
          轮椅占比: '4.35%',
          平车: '0',
          平车占比: '0.00%',
          担架: '12',
          担架占比: '26.09%',
          背入: '4',
          背入占比: '8.70%',
          怀抱: '7',
          怀抱占比: '15.22%',
          车: '4',
          车占比: '8.70%',
          其他: '12',
          其他占比: '26.09%'
        },
        {
          日期: '2020/11/14',
          急诊总人数: '33',
          步行: '8',
          步行占比: '24.24%',
          扶行: '7',
          扶行占比: '21.21%',
          轮椅: '0',
          轮椅占比: '0.00%',
          平车: '4',
          平车占比: '12.12%',
          担架: '3',
          担架占比: '9.09%',
          背入: '0',
          背入占比: '0.00%',
          怀抱: '0',
          怀抱占比: '0.00%',
          车: '3',
          车占比: '9.09%',
          其他: '8',
          其他占比: '24.24%'
        },
        {
          日期: '2020/11/13',
          急诊总人数: '75',
          步行: '9',
          步行占比: '12.00%',
          扶行: '9',
          扶行占比: '12.00%',
          轮椅: '11',
          轮椅占比: '14.67%',
          平车: '5',
          平车占比: '6.67%',
          担架: '25',
          担架占比: '33.33%',
          背入: '1',
          背入占比: '1.33%',
          怀抱: '6',
          怀抱占比: '8.00%',
          车: '3',
          车占比: '4.00%',
          其他: '6',
          其他占比: '8.00%'
        },
        {
          日期: '2020/11/12',
          急诊总人数: '32',
          步行: '0',
          步行占比: '0.00%',
          扶行: '0',
          扶行占比: '0.00%',
          轮椅: '5',
          轮椅占比: '15.63%',
          平车: '0',
          平车占比: '0.00%',
          担架: '4',
          担架占比: '12.50%',
          背入: '0',
          背入占比: '0.00%',
          怀抱: '4',
          怀抱占比: '12.50%',
          车: '4',
          车占比: '12.50%',
          其他: '15',
          其他占比: '46.88%'
        },
        {
          日期: '2020/11/11',
          急诊总人数: '26',
          步行: '7',
          步行占比: '26.92%',
          扶行: '0',
          扶行占比: '0.00%',
          轮椅: '3',
          轮椅占比: '11.54%',
          平车: '0',
          平车占比: '0.00%',
          担架: '6',
          担架占比: '23.08%',
          背入: '0',
          背入占比: '0.00%',
          怀抱: '0',
          怀抱占比: '0.00%',
          车: '4',
          车占比: '15.38%',
          其他: '6',
          其他占比: '23.08%'
        },
        {
          日期: '2020/11/10',
          急诊总人数: '46',
          步行: '6',
          步行占比: '13.04%',
          扶行: '11',
          扶行占比: '23.91%',
          轮椅: '0',
          轮椅占比: '0.00%',
          平车: '6',
          平车占比: '13.04%',
          担架: '8',
          担架占比: '17.39%',
          背入: '0',
          背入占比: '0.00%',
          怀抱: '2',
          怀抱占比: '4.35%',
          车: '2',
          车占比: '4.35%',
          其他: '11',
          其他占比: '23.91%'
        },
        {
          日期: '2020/11/9',
          急诊总人数: '33',
          步行: '0',
          步行占比: '0.00%',
          扶行: '5',
          扶行占比: '15.15%',
          轮椅: '4',
          轮椅占比: '12.12%',
          平车: '0',
          平车占比: '0.00%',
          担架: '9',
          担架占比: '27.27%',
          背入: '0',
          背入占比: '0.00%',
          怀抱: '3',
          怀抱占比: '9.09%',
          车: '0',
          车占比: '0.00%',
          其他: '12',
          其他占比: '36.36%'
        },
        {
          日期: '2020/11/8',
          急诊总人数: '75',
          步行: '11',
          步行占比: '14.67%',
          扶行: '0',
          扶行占比: '0.00%',
          轮椅: '2',
          轮椅占比: '2.67%',
          平车: '0',
          平车占比: '0.00%',
          担架: '22',
          担架占比: '29.33%',
          背入: '11',
          背入占比: '14.67%',
          怀抱: '2',
          怀抱占比: '2.67%',
          车: '21',
          车占比: '28.00%',
          其他: '6',
          其他占比: '8.00%'
        },
        {
          日期: '2020/11/7',
          急诊总人数: '33',
          步行: '4',
          步行占比: '12.12%',
          扶行: '4',
          扶行占比: '12.12%',
          轮椅: '0',
          轮椅占比: '0.00%',
          平车: '6',
          平车占比: '18.18%',
          担架: '6',
          担架占比: '18.18%',
          背入: '0',
          背入占比: '0.00%',
          怀抱: '2',
          怀抱占比: '6.06%',
          车: '0',
          车占比: '0.00%',
          其他: '11',
          其他占比: '33.33%'
        }
      ]
    }
  },
  methods: {}
}
</script>
