<template>
  <div>
    <dataTable :columns="columns" :tableData="tableData"></dataTable>
  </div>
</template>
<style lang="scss" scoped></style>
<script>
import dataTable from './components/data-table'
export default {
  components: {
    dataTable
  },
  props: {},
  data() {
    return {
      columns: [
        {
          label: '急诊总人数',
          prop: '急诊总人数'
        },
        {
          label: '死亡人数',
          prop: '死亡人数'
        },
        {
          label: '占比',
          prop: '占比'
        }
      ],
      tableData: [
        { 急诊总人数: '32', 死亡人数: '5', 占比: '15.63%' },
        { 急诊总人数: '112', 死亡人数: '2', 占比: '1.79%' },
        { 急诊总人数: '32', 死亡人数: '4', 占比: '12.50%' },
        { 急诊总人数: '53', 死亡人数: '0', 占比: '0.00%' },
        { 急诊总人数: '26', 死亡人数: '3', 占比: '11.54%' },
        { 急诊总人数: '46', 死亡人数: '0', 占比: '0.00%' },
        { 急诊总人数: '33', 死亡人数: '0', 占比: '0.00%' },
        { 急诊总人数: '75', 死亡人数: '2', 占比: '2.67%' },
        { 急诊总人数: '32', 死亡人数: '1', 占比: '3.13%' },
        { 急诊总人数: '26', 死亡人数: '0', 占比: '0.00%' },
        { 急诊总人数: '46', 死亡人数: '0', 占比: '0.00%' },
        { 急诊总人数: '33', 死亡人数: '4', 占比: '12.12%' },
        { 急诊总人数: '75', 死亡人数: '1', 占比: '1.33%' },
        { 急诊总人数: '33', 死亡人数: '0', 占比: '0.00%' }
      ]
    }
  },
  methods: {}
}
</script>
