<template>
  <div>
    <dataTable :columns="columns" :tableData="tableData"></dataTable>
  </div>
</template>
<style lang="scss" scoped></style>
<script>
import dataTable from './components/data-table'
export default {
  components: {
    dataTable
  },
  props: {},
  data() {
    return {
      columns: [
        {
          label: '日期',
          prop: '日期'
        },
        {
          label: '急诊总人数',
          prop: '急诊总人数'
        },
        {
          label: '红区',
          prop: '红区'
        },
        {
          label: '红区占比',
          prop: '红区占比'
        },
        {
          label: '黄区',
          prop: '黄区'
        },
        {
          label: '黄区占比',
          prop: '黄区占比'
        },
        {
          label: '绿区',
          prop: '绿区'
        },
        {
          label: '绿区占比',
          prop: '绿区占比'
        }
      ],
      tableData: [
        {
          日期: '2020-11-20',
          急诊总人数: '32',
          红区: '8',
          红区占比: '25.00%',
          黄区: '8',
          黄区占比: '25.00%',
          绿区: '16',
          绿区占比: '50.00%'
        },
        {
          日期: '2020/11/19',
          急诊总人数: '112',
          红区: '55',
          红区占比: '49.11%',
          黄区: '5',
          黄区占比: '4.46%',
          绿区: '52',
          绿区占比: '46.43%'
        },
        {
          日期: '2020/11/18',
          急诊总人数: '32',
          红区: '15',
          红区占比: '46.88%',
          黄区: '9',
          黄区占比: '28.13%',
          绿区: '8',
          绿区占比: '25.00%'
        },
        {
          日期: '2020/11/17',
          急诊总人数: '53',
          红区: '22',
          红区占比: '41.51%',
          黄区: '6',
          黄区占比: '11.32%',
          绿区: '25',
          绿区占比: '47.17%'
        },
        {
          日期: '2020/11/16',
          急诊总人数: '26',
          红区: '10',
          红区占比: '38.46%',
          黄区: '5',
          黄区占比: '19.23%',
          绿区: '11',
          绿区占比: '42.31%'
        },
        {
          日期: '2020/11/15',
          急诊总人数: '46',
          红区: '10',
          红区占比: '21.74%',
          黄区: '7',
          黄区占比: '15.22%',
          绿区: '29',
          绿区占比: '63.04%'
        },
        {
          日期: '2020/11/14',
          急诊总人数: '33',
          红区: '13',
          红区占比: '39.39%',
          黄区: '8',
          黄区占比: '24.24%',
          绿区: '12',
          绿区占比: '36.36%'
        },
        {
          日期: '2020/11/13',
          急诊总人数: '75',
          红区: '17',
          红区占比: '22.67%',
          黄区: '0',
          黄区占比: '0.00%',
          绿区: '58',
          绿区占比: '77.33%'
        },
        {
          日期: '2020/11/12',
          急诊总人数: '32',
          红区: '22',
          红区占比: '68.75%',
          黄区: '7',
          黄区占比: '21.88%',
          绿区: '3',
          绿区占比: '9.38%'
        },
        {
          日期: '2020/11/11',
          急诊总人数: '26',
          红区: '14',
          红区占比: '53.85%',
          黄区: '6',
          黄区占比: '23.08%',
          绿区: '6',
          绿区占比: '23.08%'
        },
        {
          日期: '2020/11/10',
          急诊总人数: '46',
          红区: '2',
          红区占比: '4.35%',
          黄区: '9',
          黄区占比: '19.57%',
          绿区: '35',
          绿区占比: '76.09%'
        },
        {
          日期: '2020/11/9',
          急诊总人数: '33',
          红区: '7',
          红区占比: '21.21%',
          黄区: '7',
          黄区占比: '21.21%',
          绿区: '19',
          绿区占比: '57.58%'
        },
        {
          日期: '2020/11/8',
          急诊总人数: '75',
          红区: '43',
          红区占比: '57.33%',
          黄区: '6',
          黄区占比: '8.00%',
          绿区: '26',
          绿区占比: '34.67%'
        },
        {
          日期: '2020/11/7',
          急诊总人数: '33',
          红区: '18',
          红区占比: '54.55%',
          黄区: '9',
          黄区占比: '27.27%',
          绿区: '6',
          绿区占比: '18.18%'
        }
      ]
    }
  },
  methods: {}
}
</script>
