<template>
  <div>
    <dataTable :columns="columns" :tableData="tableData"></dataTable>
  </div>
</template>
<style lang="scss" scoped></style>
<script>
import dataTable from './components/data-table'
export default {
  components: {
    dataTable
  },
  props: {},
  data() {
    return {
      columns: [
        {
          label: '日期',
          prop: '日期'
        },
        {
          label: '全院住院病患人数',
          prop: '全院住院病患人数'
        },
        {
          label: '急诊住院病患人数',
          prop: '急诊住院病患人数'
        },
        {
          label: '占比',
          prop: '占比'
        }
      ],
      tableData: [
        {
          日期: '2020-11-20',
          全院住院病患人数: '1425',
          急诊住院病患人数: '32',
          占比: '2.25%'
        },
        {
          日期: '2020/11/19',
          全院住院病患人数: '1421',
          急诊住院病患人数: '112',
          占比: '7.88%'
        },
        {
          日期: '2020/11/18',
          全院住院病患人数: '1420',
          急诊住院病患人数: '32',
          占比: '2.25%'
        },
        {
          日期: '2020/11/17',
          全院住院病患人数: '1411',
          急诊住院病患人数: '53',
          占比: '3.76%'
        },
        {
          日期: '2020/11/16',
          全院住院病患人数: '1395',
          急诊住院病患人数: '26',
          占比: '1.86%'
        },
        {
          日期: '2020/11/15',
          全院住院病患人数: '1400',
          急诊住院病患人数: '46',
          占比: '3.29%'
        },
        {
          日期: '2020/11/14',
          全院住院病患人数: '1399',
          急诊住院病患人数: '33',
          占比: '2.36%'
        },
        {
          日期: '2020/11/13',
          全院住院病患人数: '1402',
          急诊住院病患人数: '75',
          占比: '5.35%'
        },
        {
          日期: '2020/11/12',
          全院住院病患人数: '1444',
          急诊住院病患人数: '32',
          占比: '2.22%'
        },
        {
          日期: '2020/11/11',
          全院住院病患人数: '1444',
          急诊住院病患人数: '26',
          占比: '1.80%'
        },
        {
          日期: '2020/11/10',
          全院住院病患人数: '1442',
          急诊住院病患人数: '46',
          占比: '3.19%'
        },
        {
          日期: '2020/11/9',
          全院住院病患人数: '1441',
          急诊住院病患人数: '33',
          占比: '2.29%'
        },
        {
          日期: '2020/11/8',
          全院住院病患人数: '1421',
          急诊住院病患人数: '75',
          占比: '5.28%'
        },
        {
          日期: '2020/11/7',
          全院住院病患人数: '1453',
          急诊住院病患人数: '33',
          占比: '2.27%'
        }
      ]
    }
  },
  methods: {}
}
</script>
