<template>
  <div>
    <dataTable :columns="columns" :tableData="tableData"></dataTable>
  </div>
</template>
<style lang="scss" scoped></style>
<script>
import dataTable from './components/data-table'
export default {
  components: {
    dataTable
  },
  props: {},
  data() {
    return {
      columns: [
        {
          label: '日期',
          prop: '日期'
        },
        {
          label: '急诊总人数',
          prop: '急诊总人数'
        },
        {
          label: '转住院',
          prop: '转住院'
        },
        {
          label: '转住院占比',
          prop: '转住院占比'
        },
        {
          label: '转留观',
          prop: '转留观'
        },
        {
          label: '转留观占比',
          prop: '转留观占比'
        },
        {
          label: '其他',
          prop: '其他'
        },
        {
          label: '其他占比',
          prop: '其他占比'
        }
      ],
      tableData: [
        {
          日期: '2020-11-20',
          急诊总人数: '32',
          转住院: '7',
          转住院占比: '21.88%',
          转留观: '12',
          转留观占比: '37.50%',
          其他: '13',
          其他占比: '40.63%'
        },
        {
          日期: '2020/11/19',
          急诊总人数: '112',
          转住院: '34',
          转住院占比: '30.36%',
          转留观: '42',
          转留观占比: '37.50%',
          其他: '36',
          其他占比: '32.14%'
        },
        {
          日期: '2020/11/18',
          急诊总人数: '32',
          转住院: '11',
          转住院占比: '34.38%',
          转留观: '13',
          转留观占比: '40.63%',
          其他: '8',
          其他占比: '25.00%'
        },
        {
          日期: '2020/11/17',
          急诊总人数: '53',
          转住院: '33',
          转住院占比: '62.26%',
          转留观: '24',
          转留观占比: '45.28%',
          其他: '-4',
          其他占比: '-7.55%'
        },
        {
          日期: '2020/11/16',
          急诊总人数: '26',
          转住院: '21',
          转住院占比: '80.77%',
          转留观: '6',
          转留观占比: '23.08%',
          其他: '-1',
          其他占比: '-3.85%'
        },
        {
          日期: '2020/11/15',
          急诊总人数: '46',
          转住院: '35',
          转住院占比: '76.09%',
          转留观: '12',
          转留观占比: '26.09%',
          其他: '-1',
          其他占比: '-2.17%'
        },
        {
          日期: '2020/11/14',
          急诊总人数: '33',
          转住院: '15',
          转住院占比: '45.45%',
          转留观: '11',
          转留观占比: '33.33%',
          其他: '7',
          其他占比: '21.21%'
        },
        {
          日期: '2020/11/13',
          急诊总人数: '75',
          转住院: '32',
          转住院占比: '42.67%',
          转留观: '25',
          转留观占比: '33.33%',
          其他: '18',
          其他占比: '24.00%'
        },
        {
          日期: '2020/11/12',
          急诊总人数: '32',
          转住院: '15',
          转住院占比: '46.88%',
          转留观: '15',
          转留观占比: '46.88%',
          其他: '2',
          其他占比: '6.25%'
        },
        {
          日期: '2020/11/11',
          急诊总人数: '26',
          转住院: '11',
          转住院占比: '42.31%',
          转留观: '1',
          转留观占比: '3.85%',
          其他: '14',
          其他占比: '53.85%'
        },
        {
          日期: '2020/11/10',
          急诊总人数: '46',
          转住院: '26',
          转住院占比: '56.52%',
          转留观: '2',
          转留观占比: '4.35%',
          其他: '18',
          其他占比: '39.13%'
        },
        {
          日期: '2020/11/9',
          急诊总人数: '33',
          转住院: '17',
          转住院占比: '51.52%',
          转留观: '6',
          转留观占比: '18.18%',
          其他: '10',
          其他占比: '30.30%'
        },
        {
          日期: '2020/11/8',
          急诊总人数: '75',
          转住院: '37',
          转住院占比: '49.33%',
          转留观: '18',
          转留观占比: '24.00%',
          其他: '20',
          其他占比: '26.67%'
        },
        {
          日期: '2020/11/7',
          急诊总人数: '33',
          转住院: '11',
          转住院占比: '33.33%',
          转留观: '9',
          转留观占比: '27.27%',
          其他: '13',
          其他占比: '39.39%'
        }
      ]
    }
  },
  methods: {}
}
</script>
