<template>
  <div>
    <dataTable :columns="columns" :tableData="tableData"></dataTable>
  </div>
</template>
<style lang="scss" scoped></style>
<script>
import dataTable from './components/data-table'
export default {
  components: {
    dataTable
  },
  props: {},
  data() {
    return {
      columns: [
        {
          label: '患者id',
          prop: '患者id'
        },
        {
          label: '患者姓名',
          prop: '患者姓名'
        },
        {
          label: '性别',
          prop: '性别'
        },
        {
          label: '年龄（岁）',
          prop: '年龄（岁）'
        },
        {
          label: '急诊滞留时间',
          prop: '急诊滞留时间'
        },
        {
          label: '急诊等待时间',
          prop: '急诊等待时间'
        },
        {
          label: '急诊留观时间',
          prop: '急诊留观时间'
        }
      ],
      tableData: [
        {
          患者id: '100037274',
          患者姓名: '王喆',
          性别: '男',
          '年龄（岁）': '43',
          急诊滞留时间: '42分 14秒',
          急诊等待时间: '43分 53秒',
          急诊留观时间: '1小时 45分 36秒'
        },
        {
          患者id: '100038872',
          患者姓名: '蔡玲',
          性别: '女',
          '年龄（岁）': '24',
          急诊滞留时间: '12分 34秒',
          急诊等待时间: '25分 42秒',
          急诊留观时间: '1小时 45分 4秒'
        },
        {
          患者id: '100049272',
          患者姓名: '罗大毛',
          性别: '男',
          '年龄（岁）': '32',
          急诊滞留时间: '1小时 27分 43秒',
          急诊等待时间: '35分 52秒',
          急诊留观时间: '4小时 30分 4秒'
        },
        {
          患者id: '100087724',
          患者姓名: '杜坤',
          性别: '男',
          '年龄（岁）': '53',
          急诊滞留时间: '15分 3秒',
          急诊等待时间: '36分 47秒',
          急诊留观时间: '1小时 10分 4秒'
        },
        {
          患者id: '100048275',
          患者姓名: '袁小雨',
          性别: '女',
          '年龄（岁）': '32',
          急诊滞留时间: '46分 36秒',
          急诊等待时间: '54分 14秒',
          急诊留观时间: '34分 14秒'
        },
        {
          患者id: '100038262',
          患者姓名: '李玲玲',
          性别: '女',
          '年龄（岁）': '25',
          急诊滞留时间: '49分 53秒',
          急诊等待时间: '42分 46秒',
          急诊留观时间: '43分 37秒'
        },
        {
          患者id: '100083736',
          患者姓名: '张迪',
          性别: '女',
          '年龄（岁）': '53',
          急诊滞留时间: '1小时 38分 43秒',
          急诊等待时间: '25分 47秒',
          急诊留观时间: '41分 7秒'
        },
        {
          患者id: '100033772',
          患者姓名: '王博',
          性别: '男',
          '年龄（岁）': '32',
          急诊滞留时间: '38分 38秒',
          急诊等待时间: '35分 46秒',
          急诊留观时间: '2小时 14分 3秒'
        },
        {
          患者id: '100044382',
          患者姓名: '任豪',
          性别: '男',
          '年龄（岁）': '23',
          急诊滞留时间: '44分 3秒',
          急诊等待时间: '1小时 31分 36秒',
          急诊留观时间: '58分 25秒'
        },
        {
          患者id: '100027262',
          患者姓名: '卢岜',
          性别: '男',
          '年龄（岁）': '51',
          急诊滞留时间: '1小时 32分 54秒',
          急诊等待时间: '47分 25秒',
          急诊留观时间: '9小时 7分 54秒'
        },
        {
          患者id: '100072728',
          患者姓名: '石迪威',
          性别: '男',
          '年龄（岁）': '34',
          急诊滞留时间: '1小时 45分 4秒',
          急诊等待时间: '1小时 27分 43秒',
          急诊留观时间: '57分 25秒'
        },
        {
          患者id: '100027279',
          患者姓名: '万可',
          性别: '男',
          '年龄（岁）': '25',
          急诊滞留时间: '44分 3秒',
          急诊等待时间: '22分 6秒',
          急诊留观时间: '57分 25秒'
        },
        {
          患者id: '100028726',
          患者姓名: '龚雨',
          性别: '女',
          '年龄（岁）': '63',
          急诊滞留时间: '25分 43秒',
          急诊等待时间: '34分 4秒',
          急诊留观时间: '46分 14秒'
        },
        {
          患者id: '100027264',
          患者姓名: '雷松',
          性别: '男',
          '年龄（岁）': '73',
          急诊滞留时间: '55分 33秒',
          急诊等待时间: '37分 25秒',
          急诊留观时间: '7小时 37分 45秒'
        }
      ]
    }
  },
  methods: {}
}
</script>
